import { Recipe } from '/@/types/cookbook'

const recipes: Recipe[] = [
  {
    title: 'קרם וניל למילוי עוגות',
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '2 שמנת מתוקה',
          '4 כפות סוכר',
          '2 סוכר וניל',
          '1.5 כוסות חלב',
          '1 אינסטנט פודינג וניל'
        ]
      }
    ],
    steps: ['להקציף הכל יחד.'],
    notes: 'מעולה.'
  },
  {
    title: `ספינג'ים`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 ק"ג קמח',
          '30 גרם שמרים',
          'קורט מלח',
          '4 כפות סוכר',
          '4 כוסות מים פושרים',
          '1 ביצה',
          'שמן לטיגון עמוק'
        ]
      },
      {
        title: 'לסירופ',
        ingredients: ['3 כוסות סוכר', '2 כוסות מים', 'מיץ מלימון אחד']
      }
    ],
    steps: [
      'מערבבים את כל חומרי הבצק (שמרים יבשים יש להתפיח קודם, שמרים לחים - מוסיפים ישירות). לשים היטב עד שמתקבל בצק רך ודביק (אם חסר מים מוסיפים קצת מים פושרים).',
      'מתפיחים כשעה - קערה עטופה בנייר ניילון נצמד, ומגבת.',
      'כעבור שעה לשים את הבצק, ומתפיחים חצי שעה נוספת.',
      'מרתיחים שמן בסיר עמוק, בוצעים פיסות קטנות מן הבצק ומטגנים משני הצדדים.',
      "ממיסים את חומרי הסירופ בסיר, טובלים את הספינג'ים המוכנים, ומגישים."
    ],
    notes: 'במקום סירופ אפשר לבזוק אבקת סוכר.'
  },
  {
    title: `עוגיות שוקולד צ'יפס`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          `125 ג' חמאה מרוככת`,
          `1 כוס סוכר`,
          '1/2 כפית תמצית וניל',
          '1 ביצה טרופה',
          '1 3/4 כוסות קמח תופח',
          '150 גרם שבבי שוקולד'
        ]
      }
    ],
    steps: [
      `מקציפים חמאה + סוכר + תמצית וניל, מוסיפים בהדרגה את הביצה תוך הקצפה, ובסוף מוסיפים את הקמח.`,
      `מערבבים הכל לתערובת אחידה, מוסיפים את השוקולד ושוב מערבבים.`,
      'מכניסים לחצי שעה במקרר.',
      'יוצרים כדורים קטנים ואופים ב-180 מעלות עד השחמה.'
    ]
  },
  {
    title: `עוגיות טחינה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['3 כוסות קמח', `200 ג' חמאה`, 'כוס סוכר', 'כוס טחינה גולמית', '1 סוכר וניל']
      }
    ],
    steps: [
      'לערבב הכל, עיגולים על תבנית - לשים מעל כל עוגיה סוכר וקצת שקדים פרוסים (או אגוזים או מה שבא לי).',
      'אופים על 170 מעלות ל-15 דקות.',
      'אחרי האפייה מקררים את העוגיות ורק אז מוציאים אותן, כדי שלא יתפרקו.'
    ]
  },
  {
    title: `עוגת דבש`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '5 ביצים מופרדות',
          'כוס סוכר',
          '1 כוס שמן',
          '1/2 כוס דבש',
          '1/3 כוס מייפל',
          '1 שמנת מתוקה',
          '2 כוסות קמח תופח',
          '1 כפית קינמון',
          '1/2 כפית סודה לשתייה'
        ]
      },
      {
        title: 'סירופ',
        ingredients: ['1/2 כוס מים', '1/3 כוס סוכר', '1/3 כוס מייפל']
      }
    ],
    steps: [
      'מקציפים 5 חלבונים עם כוס סוכר לקצפת יציבה.',
      'לערבב את שאר החומרים ביחד (קודם יבשים ורטובים ואח"כ לאחד), ולהוסיף להם את תערובת הקצפת.',
      'להכניס לתבנית (אינגליש קייק זה טוב), 150 מעלות במשך 45 דקות.',
      'להרתיח את חומרי הסירופ, ולשפוך בעדינות על העוגה המוכנה בצורה אחידה.'
    ]
  },
  {
    title: `עוגת גבינה אפויה (אלינור)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '6 ביצים',
          'כוס סוכר',
          '750 גרם גבינה לבנה',
          'גביע וחצי שמנת חמוצה',
          '3 כפות אינסטנט פודינג וניל',
          '2 כפות קמח תופח',
          '1 כף קורנפלור',
          'קליפת לימון מגוררת',
          '1 סוכר וניל'
        ]
      }
    ],
    steps: [
      'מפרידים את הביצים, ומקציפים את החלבון עם הסוכר לקצף קשה ויציב.',
      'את שאר החומרים מערבבים יחד, ובסוף מקפלים את תערובת הקצף לתערובת השנייה עד אחידות.',
      'בתנור, 180 מעלות, עד שזה נראה טוב!'
    ],
    notes: 'לא מומלץ לאכול את זה היישר מן התנור, יש לחכות עד התייצבות ☺'
  },
  {
    title: `יחידות שוקולד קטנות (אלינור)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '350 גרם שוקולד מריר',
          '50 גרם חמאה',
          '3 ביצים',
          '1/2 כוס סוכר',
          '3/4 כוס קמח תופח',
          '1 כף ליקר (תפוזים)',
          '1 כף תמצית וניל'
        ]
      }
    ],
    steps: [
      'ממיסים שוקולד לחמאה.',
      'מקציפים ביצים וסוכר.',
      'מוסיפים את תערובת השוקולד אל מקצפת הביצים והסוכר בקיפול, ולאחר מכן מוסיפים בקיפול את הקמח.',
      'לבסוף, מוסיפים את הליקר והוניל.',
      "שמים את התערובת שעה במקרר לפחות, להתייצבות התערובת, ולאחר מכן מחלקים למנג'טים קטנים (או לתבנית שקעים פצפונים), 170-180 מעלות בתנור, בסביבות 10-15 דקות.",
      'נא להשגיח.'
    ]
  },
  {
    title: `פוקצ'ה`,
    ingredients: [
      {
        title: 'חומרים לבצק',
        ingredients: [
          '5 כוסות קמח',
          '50 גרם שמרים טריים (גרגרים)',
          '1 1/4 כפית מלח',
          '1 1/4 כפית סוכר',
          '2 1/2 כפות עשבי תיבול קצוצים',
          '5 כפות שמן זית',
          '1 1/2 מים פושרים'
        ]
      }
    ],
    steps: [
      'שמים בקערה את הקמח (המנופה) עם המלח והסוכר ומערבבים.',
      'מוסיפים את כל החומרים חוץ מהמים, ומערבבים. יוצקים את המים בהדרגה עד לקבלת בצק אחיד. לשים את הבצק בין 5-7 דקות (בידיים!).',
      'מתפיחים במקום חמים כשעה, לשים שוב.',
      "מתפיחים שנית במשך כשעה, ולאחר מכן אפשר לרדד מעט, ויוצרים את הצורה הרצויה (אפשר לעשות אליפסות ארוכות, אפשר לעשות עיגולים קטנים, אפשר גם פוק'צה אחת עצומה).",
      'מעבירים לתבנית מקומחת. מורחים שמן זית על הבצק ומפזרים מעט מלח גס. מתפיחים חצי שעה נוספת.',
      "עכשיו אפשר לשים מעל מה שבא לנו - פרוסות עגבניה, חציל, פלפל, בצל (מטוגן או לא), זיתים... שמים בתנור על 200 מעלות עד הזהבה (משהו כמו 20 דקות). רצוי להגיש עם מטבלים שונים (שמנת, פסטו, זיתים וכו'...)."
    ],
    notes: '- יאמי -'
  },
  {
    title: `עוגת וניל פשוטה ונחמדה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          'כוס סוכר',
          '200 גרם חמאה',
          '2 כפיות תמצית וניל',
          '3 ביצים',
          '200 מ"ל יוגורט (אפשר יוגורט וניל)',
          '380 גרם קמח תופח'
        ]
      }
    ],
    steps: [
      'מקציפים 10 דקות את הסוכר, החמאה והוניל.',
      'מוסיפים את הביצים, אחת אחת - לא מוסיפים ביצה נוספת עד שהקודמת לא נבלעה לחלוטין.',
      'מוסיפים את היוגורט בזרם דק. מקציפים עוד דקה, מכבים את המיקסר.',
      'מוסיפים את הקמח ומקפלים עם מרית עד אחדות (לא יותר מדי).',
      'בשתי תבניות אינגליש קייק משומנות, 25-30 דקות ב-180 מעלות.'
    ]
  },
  {
    title: `ריבה של סבתא תמרה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 ק"ג פרי חתוך לקוביות קטנות (עדיפות לפירות רכים...)',
          '1/2 ק"ג סוכר',
          '2 כפות פודינג (עדיף וניל, אבל אפשר גם שוקולד)',
          '1/2 כף קינמון',
          'כף וחצי מיץ לימון (סחוט טרי)'
        ]
      }
    ],
    steps: [
      'שמים את הפרי החתוך והמוכן עם הסוכר בסיר, ומבשלים על אש בינונית עד קטנה במשך כ-3/4 שעה. נא להקפיד על ערבוב מדי כמה דקות.',
      'מערבבים בצלוחית קטנה את הפודינג, הקינמון והמיץ לימון, ומוסיפים לסיר.',
      'ממשיכים לבשל עוד כרבע שעה, ומסירים מהאש.'
    ],
    notes: 'יש להקפיד לערבב גם לאחר כיבוי הלהבה, למען מניעת גושים.'
  },
  {
    title: `עוגת שבבי שוקולד`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '100 גרם חמאה רכה',
          '1 כוס סוכר',
          '2 ביצים',
          '2 כוסות קמח',
          '2 כפיות אבקת אפיה',
          '1/2 כפית סודה לשתיה',
          '1 גביע שמנת גדול, או שניים קטנים => 150 מ"ל.'
        ]
      },
      {
        title: 'לערבב בצד',
        ingredients: ['רבע כוס סוכר חום', '1 כפית קינמון', '150 גרם שבבי שוקולד']
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות.',
      'מערבבים חומרים רטובים ויבשים בנפרד.',
      'מאחדים תערובות, ומוסיפים את השוקולד - לא לערבב יותר מדי.',
      "משהו כמו 40 ד' בתנור, לא על טורבו."
    ],
    notes:
      'אה! לפני שמכניסים לתנור בשתי תבניות אינגליש קייק, שמים כף רוטב מייפל על כל עוגה (ואז לתנור!)'
  },
  {
    title: `עוגת גבינה וצימוקים, לשבועות`,
    ingredients: [
      {
        title: 'חומרים לבסיס',
        ingredients: [
          '200 גרם ביסקוויטים, מרוסקים',
          '100 גרם חמאה, מומסת',
          'קורט קינמון טחון',
          '100 גרם צימוקים'
        ]
      },
      {
        title: 'למלית',
        ingredients: [
          '3 גביעי גבינה לבנה 9% (750 גרם)',
          '1 כוס סוכר',
          '1 שקית סוכר וניל',
          '6 ביצים, מופרדות לחלמונים ולחלבונים',
          '2 כפות סוכר'
        ]
      },
      {
        title: 'לציפוי',
        ingredients: ['1 גביע שמנת חמוצה', '2 כפות אבקת סוכר']
      },
      {
        title: 'תבנית בקוטר 26 ס"מ, משומנת ומרופדת בנייר אפייה',
        ingredients: []
      }
    ],
    steps: [
      'מחממים תנור לחום בינוני (180 מעלות).',
      'להכנת הבסיס: מערבבים בקערה את פירורי הביסקוויטים, החמאה והקינמון לתערובת אחידה, ושוטחים בתחתית התבנית. מפזרים את הצימוקים על הבסיס.',
      'להכנת המלית: טורפים בקערה את הגבינה, הסוכר, סוכר-הווניל והחלמונים.',
      'שמים בקערת המערבל את החלבונים והסוכר, ומקציפים לקצף נוקשה. מקפלים בעדינות לתערובת הגבינה.',
      'שוטחים את תערובת הגבינה על בסיס הביסקוויטים, ואופים 40-45 דקות.',
      'להכנת הציפוי: טורפים את השמנת עם אבקת הסוכר. מורחים את התערובת על העוגה האפויה ואופים, 2-3 דקות נוספות.'
    ]
  },
  {
    title: `עוגת שוקולד נהדרת, לפסח`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '150 גרם שוקולד מריר, שבור לקוביות',
          '150 גרם חמאה',
          '150 גרם סוכר',
          '6 ביצים, מופרדות לחלמונים ולחלבונים',
          '150 גרם אגוזים, טחונים',
          '1 כף קמח מצה, מנופה'
        ]
      },
      {
        title: 'תבנית בקוטר 24 ס"מ, משומנת ומרופדת בנייר אפייה',
        ingredients: []
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות. ממיסים את השוקולד, במיקרוגל או בסיר כפול.',
      'שמים בקערת המערבל את החמאה והסוכר, וטורפים לתערובת קלילה וקצפית. מוסיפים את החלמונים, אחד אחד, וטורפים היטב אחרי כל הוספה.',
      'טורפים פנימה את השוקולד המומס, האגוזים וקמח המצה.',
      'מקציפים את החלבונים לקצף נוקשה, ומקפלים בעדינות לתערובת החמאה.',
      'יוצקים בעדינות לתבנית ואופים כ-45 דקות. מתקבלת עוגה נמוכה. אפשר לצפות בזיגוג שוקולד.'
    ]
  },
  {
    title: `עוגת אגוזים, לפסח`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '6 ביצים',
          '1 כוס סוכר',
          '2 כוסות אגוזים, טחונים',
          '3 כפות קמח מצה, מנופה',
          '1/4 כוס מיץ תפוזים',
          '1 מיכל שמנת לקצפת',
          '2 כפות אבקת סוכר',
          'מעט שוקולד מריר, מגורר'
        ]
      },
      {
        title: 'תבנית בקוטר 26 ס"מ, משומנת',
        ingredients: []
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות. מקציפים את הביצים, מוסיפים בהדרגה את הסוכר וממשיכים להקציף לקצף יציב.',
      'מערבבים בקערה את האגוזים וקמח המצה, ומקפלים בעדינות את קצף הביצים. מוסיפים גם את מיץ התפוזים, ומערבבים בעדינות.',
      'שוטחים את הבלילה בתבנית, ואופים כ-20 דקות. מצננים.',
      'מקציפים את השמנת ואבקת הסוכר לקצפת יציבה ומעטרים בה את העוגה. זורים מעל שוקולד מגורר.'
    ]
  },
  {
    title: `פנקייקים`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          'כוס קמח תופח',
          '2 ביצים',
          '1/3 כוס חלב',
          '1 גביע יוגורט',
          'חצי כוס סוכר',
          '3 כפות שמן',
          'תמצית וניל'
        ]
      }
    ],
    steps: ['לערבב חומרים יבשים ורטובים בנפרד, לאחד תערובות ולטגן על אש נמוכה.']
  },
  {
    title: `עוגת גבינה עם ריבת חלב`,
    ingredients: [
      {
        title: 'בסיס',
        ingredients: ['1 חבילת בישקוטים', 'כוס קפה נמס לא רותח']
      },
      {
        title: 'מלית',
        ingredients: [
          '3 מיכלים שמנת מתוקה',
          '1 שקית אינסטנט פודינג וניל',
          '1 כוס סוכר',
          '1 כפית תמצית וניל',
          '750 גרם גבינה לבנה 5%',
          '2 כפות גדושות ריבת חלב'
        ]
      },
      {
        title: 'ציפוי',
        ingredients: ['מעט ריבת חלב לזילוף']
      },
      {
        title: 'תבנית 26 מתפרקת',
        ingredients: []
      }
    ],
    steps: [
      'מסדרים את הבישקוטים הטבולים בקפה בתחתית התבנית.',
      'מקציפים שמנת מתוקה, אינסטנט פודינג וניל, סוכר, תמצית וניל - עד לקבלת קרם יציב.',
      'מוסיפים גבינה לבנה וריבת חלב, ומקציפים במהירות נמוכה עד לקבלת תערובת אחידה.',
      'משטחים את התערובת היציבה בתבנית, מקשטים עם ריבת חלב.'
    ],
    notes: 'לילה במקרר.'
  },
  {
    title: `עוגת ספירלה גבינה ושוקולד (תבנית 26)`,
    ingredients: [
      {
        title: 'לתחתית',
        ingredients: [
          '150 גרם ביסקוויטים טחונים',
          '2 כפות קקאו (20 גרם)',
          '1/4 כוס אבקת סוכר',
          '100 גרם חמאה מומסת'
        ]
      },
      {
        title: 'למלית',
        ingredients: ['1 קילו גבינה לבנה 5%', '3/4 כוס (150 גרם) סוכר', '6 ביצים']
      },
      {
        title: 'לתערובת שוקולד לבן',
        ingredients: ['200 גרם שוקולד לבן', '1/3 כוס (80 מ"ל) שמנת מתוקה', '1 כף (10 גרם) קורנפלור']
      },
      {
        title: 'לתערובת שוקולד מריר',
        ingredients: ['200 גרם שוקולד מריר', '1/2 כוס (120 מ"ל) שמנת מתוקה', '1 כפית אבקת קפת נמס']
      }
    ],
    steps: [
      'מכינים את התחתית: מערבבים פירורי עוגיות עם קקאו, אבקת סוכר וחמאה מומסת, ומהדקים לתחתית תבנית מרופדת בנייר אפייה. שומרים במקפיא, עד שמלית הגבינה מוכנה.',
      'מכינים את מלית הגבינה: בקערה טורפים (בעדינות רבה, לא מקציפים!) גבינה וסוכר עד שהסוכר נמס והתערובת חלקה. מוסיפים ביצים וטורפים לתערובת חלקה. מחלקים את התערובת באופן שווה בין 2 קערות.',
      'לתערובת הבהירה: ממיסים יחד שוקולד לבן ושמנת מתוקה (במיקרוגל או מעל אדים). מערבבים היטב עד שהשוקולד נמס ומצננים מעט. מוסיפים לתערובת הגבינה באחת מהקערות. מעבירים כוס מהבלילה לקערית, מוסיפים פנימה קורנפלור וטורפים היטב לתערובת חלקה ללא גושים. מחזירים את הכמות הקטנה לתערובת ומערבבים יחד.',
      'לתערובת הכהה: ממיסים שוקולד מריר, שמנת מתוקה וקפה ומערבבים עד שהשוקולד נמס. מוסיפים את תערובת השוקולד לתערובת הגבינה בקערה הנותרת, וטורפים לקבלת תערובת חלקה.',
      'מרכיבים ואופים: יוצקים מים רותחים לתבנית גדולה ומניחים בתחתית התנור. מעבירים כל אחת מהתערובות לכד מזיגה ויוצקים באופן הבא: יוצקים בערך כמות של כוס מהתערובת הכהה למרכז התבנית. התערובת תתפשט ותכסה את התחתית. יוצקים שוב למרכז התבנית כמות של כוס בערך - הפעם מהתערובת הבהירה. יוצקים כוס מהתערובת הכהה למרכז התערובת הבהירה, וממשיכים כך לסירוגין עד לסיום הבלילות. מתקבלת דוגמת טבעות. מעבירים (בזהירות!) את התבנית לתנור ואופים שעה ורבע, ב-140 מעלות עד שהעוגה יציבה בשוליים ורוטטת במרכזה. מוציאים מהתנור ומניחים להתקרר לחלוטין. מעבירים למקרר ל-24 שעות. שומרים את העוגה במקרר ומגישים קר.'
    ]
  },
  {
    title: `רוטב לסלט כרוב סיני`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['רבע כוס סוכר', 'רבע כוס חומץ', 'רבע כוס שמן (עדיף שומשום)', '2 כפות סויה']
      }
    ]
  },
  {
    title: `עוגה בחושה טעימה (אירה)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '3 ביצים',
          '2 כוסות קמח',
          'שקית אבקת אפייה',
          '1 1/2 כוסות סוכר',
          '100 גרם חמאה',
          'קמצוץ מלח',
          '1 שמנת',
          'גרידת לימון / תפוז',
          'כף מיץ לימון'
        ]
      }
    ],
    notes: 'אפשר לשדרג ע"י הוספת צימוקים, שברי אגוזים...'
  },
  {
    title: `עוגת גבינה בחושה מעולה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '750 גרם גבינה לבנה (9% עדיף)',
          '2 ביצים',
          '1 שמנת חמוצה',
          'כוס סוכר',
          '4 כפות סולת',
          'מעט וניל',
          'לפזר בתחתית מעט פירורי לחם'
        ]
      },
      {
        title: '160 מעלות שעה וחצי',
        ingredients: []
      },
      {
        title: 'אפשר לשדרג:',
        ingredients: [
          'תחתית של פקאנים שבורים / ביסקוויטים שבורים וחמאה',
          'ציפוי של ריבה',
          'ציפוי שמנת חמוצה וסוכר'
        ]
      }
    ]
  },
  {
    title: `חצילים ברוטב יוגורט`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '2 חצילים בינוניים',
          '1 יוגורט',
          '2 כפות מיץ לימון טרי',
          'מלח ופלפל (גרוס עדיף)',
          '4 שיני שום'
        ]
      }
    ],
    steps: [
      'לקלף ולחתוך את החצילים (קוביות / עיגולים), להניח במסננת ולפזר מעל מלח, להשהות במשך שעתיים. לסחוט את כל הנוזלים ולספוג בעזרת מגבת. לטגן את החצילים עד שהם נהיים שחומים. לערבב את שאר החומרים של הרוטב.',
      'להניח את החצילים בצלחת שטוחה מעל הרוטב ואיזה עלה נענע...'
    ]
  },
  {
    title: `מרק אפונה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '600 גרם אפונה קפואה',
          '1 בצל קצוץ',
          '2 כפות אבקת מרק',
          'מלח ופלפל',
          '8 כוסות מים'
        ]
      }
    ],
    steps: [
      'לבשל את כל המרכיבים עד לרתיחה, להנמיך את הלהבה ולהמשיך לבשל 15 דקות.',
      'כאשר מצטנן לרסק הכל בממחה.'
    ],
    notes: 'הולך טוב עם קרוטונים.'
  },
  {
    title: `חטיפי קישואים מטוגנים`,
    ingredients: [
      {
        title: '5 קישואים - שטופים, לא מקולפים, חתוכים לרצועות ארוכות',
        ingredients: []
      },
      {
        title: 'בלילה - לערבב הכל',
        ingredients: [
          'כוס קמח',
          'כפית מלח',
          'פלפל שחור גרוס',
          '3 כפות שמן זית',
          '3 כפות פטרוזיליה קצוצה',
          'ביצה'
        ]
      }
    ],
    steps: [
      'לטבול את הקישואים בבלילה ולטגן בשמן עמוק עד להזהבה.',
      'להגיש חם, אפשר בליווי לימון חצוי.'
    ]
  },
  {
    title: `עוגת שוקולד לפסח`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '3 ביצים',
          '200 גרם שוקולד מריר מומס',
          '1 כוס סוכר',
          '100 גרם חמאה',
          'חצי כוס שמן',
          '2 כפות קוניאק',
          'כוס קוקוס טחון',
          'כוס קמח מצה',
          '1 שקיק אבקת אפייה'
        ]
      },
      {
        title: 'ציפוי',
        ingredients: ['100 גרם שוקולד מריר', '1 שמנת מתוקה']
      }
    ],
    steps: ['מערבבים הכל בתבנית 26, 190 מעלות עד שקיסם ננעץ פנימה ויוצא נקי ויבש. (ואז ציפוי...)']
  },
  {
    title: `מעויני קינמון`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '300 גרם קמח',
          '225 גרם חמאה רכה',
          '250 גרם סוכר חום',
          '3 כפות קינמון',
          '1/2 כפית מלח',
          '1 ביצה'
        ]
      }
    ],
    steps: ['180 מעלות, לשטח בתבנית, 20 דקות, וכשמוציאים לחתוך לקוביות. לצנן!']
  },
  {
    title: `עוגיות תחרה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '160 גרם חמאה',
          'כוס סוכר',
          '4 כפות חלב',
          '4 כפות קמח',
          '200 גרם שקדים טחונים גס (מרוסקים בתוך שקית ניילון עם פטיש)'
        ]
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות.',
      'שמים בסיר את החמאה והסוכר וממיסים על אש קטנה עד שמזהיב.',
      'מוסיפים תוך בחישה את החלב, הקמח והשקדים.',
      'בתבנית של תנור במרחקים גדולים זו מזו (להוריד כמות קטנה עם תבנית).',
      '8 דקות, לשים לב היטב שלא יישרף!'
    ],
    notes: '- עוגיות עדינות -'
  },
  {
    title: `עוגת גבינה ופירורים - תבנית עגולה 24`,
    ingredients: [
      {
        title: 'בסיס',
        ingredients: ['250 גרם ביסקוויטים מפוררים דק', '150 גרם חמאה']
      },
      {
        title: 'מלית',
        ingredients: [
          '1 שמנת מתוקה',
          '2 כפות סוכר',
          '500 גרם גבינה לבנה 9%',
          '3/4 כוס סוכר',
          '1 שקית סוכר וניל',
          'טיפה טיפה גרידת לימון בשביל הנשמה...'
        ]
      }
    ],
    steps: [
      'לערבב את הביסקוויטים עם החמאה ולשטח 2/3 בתבנית, את השאר לשמור לפירורים.',
      'להקציף את השמנת עם 2 כפות הסוכר',
      'לערבב את שאר המרכיבים.',
      'לאחד את התערובות בתנועות קיפול, ליצוק בתבנית ולפזר מעל את הפירורים שנותרו.'
    ],
    notes: 'לאחסן מקרר איזה יום לפני ההגשה.'
  },
  {
    title: `נשיקות`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['5 חלבונים', 'כוס סוכר', 'כף אבקת סוכר', 'כפית קקאו']
      }
    ],
    steps: [
      'מקציפים harsh את החלבונים והסוכר.',
      'מנפים פנימה את אבקת הסוכר והקקאו, ומקפלים.',
      'משהו כמו שעתיים (בלי נדר) בחום 110 מעלות, טורבו.'
    ]
  },
  {
    title: `קצפת`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['1 שמנת מתוקה', '2 כפות סוכר']
      }
    ],
    steps: ['להקציף.']
  },
  {
    title: `כוסמת`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['כוסמת']
      }
    ],
    steps: [
      'שוטפים היטב 1 כוס של כוסמת.',
      'מכניסים לסיר ומוסיפים 2 כוסות מים.',
      'מכסים את הסיר חלקית ומביאים לרתיחה.',
      'מבשלים לאחר רתיחה על להבה נמוכה 15-20 דקות, עד שהכוסמת מתרככת.',
      'מכבים את הלהקה ומשאירים מכוסה היטב עוד 15-20 דקות.',
      'מתבלים לפי הטעם (יותר מכפית שטוחה של מלח לכוס).'
    ],
    notes: 'להוסיף בסוף שמן זית.'
  },
  {
    title: `עוגת שוקולד ללא גלוטן ועדיין מעולה`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 שמנת מתוקה',
          '300 גרם שוקולד מריר (עדיף איכותי)',
          '100 גרם שוקולד לבן',
          '200 גרם חמאה',
          '100 גרם אגוזי לוז קלויים וטחונים',
          '4 ביצים',
          '3/4 כוס סוכר'
        ]
      }
    ],
    steps: [
      'גנאש: מרתיחים (כמעט) את השמנת המתוקה ויוצקים על 100 גרם שוקולד מריר שבור לקוביות. שומרים במקרר למשך לילה (או סתם כמה שעות).',
      'מחממים תנור ל-160 מעלות. בסיר כפול ממיסים את החמאה ו-200 גרם שוקולד מריר (עדיף סיר מספיק גדול לאחר כך). מוסיפים לתערובת השוקולד את אגוזי הלוז.',
      'מקציפים 4 חלמונים + חצי כוס סוכר ומוסיפים לתערובת בקיפול.',
      'מקציפים 4 חלבונים + רבע כוס סוכר ומקפלים לתערובת השוקולד.',
      'תבנית 24 עגולה, משומנת ומרופדת בנייר אפייה (בלי נדר), 40 דקות עד שקיסם יוצא יבש.',
      'מקציפים את הגנאש ומורחים על העוגה, ומעל הגנאש את השוקולד הלבן מתולתל או משהו.'
    ],
    notes: 'מתאימה לפסח.'
  },
  {
    title: `תחתית לעוגת קוקוס - מתאימה לפסח, ללא גלוטן`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: ['6 חלבונים בטמפרטורת החדר', '1 כוס סוכר', '2 כוסות קוקוס']
      }
    ],
    steps: [
      'מחממים תנור ל-180 מעלות.',
      'מקציפים במיקסר את החלבונים במהירות בינונית כדקה.',
      'מוסיפים סוכר בהדרגה עד לקבלת קצף יציב ומבריק.',
      'מוסיפים קוקוס (לא בהכרח בבת אחת) ומקפלים.',
      'תבנית 26 משומנת, 30 דקות עד להזהבה.'
    ],
    notes: 'אופציה נחמדה: ציפוי של קרם שוקולד, ומעל קצפת.'
  },
  {
    title: `סופגניות קוקוס - בלי שמרים ☺`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 כוס קמח תופח',
          '5 כפות קוקוס',
          '1 ביצה',
          '1 גביע לבן',
          '2 כפות סוכר',
          '1/2 שקית סוכר וניל'
        ]
      }
    ],
    steps: ['לטגנוש!']
  },
  {
    title: `סופניות לבן - ללא שמרים, מאוד מוצלחות`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '2 ביצים',
          '2 גביעי לבן / אשל (/יוגורט)',
          '6 כפות לא שטוחות סוכר',
          '1/4 כפית מלח',
          'כף ברנדי / ויסקי',
          'כפית תמצית וניל',
          'גרידה מחצי לימון עד לימון שלם, תלוי בחשקים...',
          '350 גרם קמח תופח'
        ]
      }
    ],
    steps: [
      'לערבב בקערה את כל המצרכים לפי הסדר',
      'רצוי לטגן על להבה לא כל כך גדולה, כדי שגם מבפנים ייעשה כראוי.',
      'במידה ומבחוץ עשוי ומבפנים לא - ניתן להכניס לתנור (160 - 180...) על רשת ככה שהשמן יטפטף.'
    ]
  },
  {
    title: `עוגת תפוזים נפלאה של עמליה - שתי אינגליש קייק`,
    ingredients: [
      {
        title: 'בסיס',
        ingredients: ['5 ביצים', 'כוס סוכר', 'כוס קמח תופח']
      },
      {
        title: 'קרם',
        ingredients: ['2 כוס חלב', '2 שמנת מתוקה', '2 אינסטנט וניל']
      },
      {
        title: '2 כוסות מיץ תפוזים',
        ingredients: []
      }
    ],
    steps: [
      'מקציפים (למרות שזה לא באמת מקציף...) את הביצים והסוכר.',
      'מוסיפים כוס קמח תופח, מקפלים רבע כל פעם.',
      'אופים לפי הרגש...',
      'חוצים את העוגה ל-2 שכבות, וההרכבה הולכת כך: שכבת עוגה תחתונה -> מיץ תפוזים -> קרם -> שכבת עוגה -> מיץ תפוזים -> קרם.',
      'יומיים במקרר לפני הגשה.'
    ],
    notes: 'נפלא!'
  },
  {
    title: `אזני המן (במילוי לוטוס)`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '200 גרם חמאה רכה חתוכה לקוביות',
          '100 גרם אבקת סוכר (לא סוכר רגיל!)',
          '300 גרם קמח',
          'כפית ממרח לוטוס',
          'חלמון ביצה אחד'
        ]
      }
    ],
    steps: [
      'שמים את כל המצרכים למעט החלמון בקערת מיקסר עם וו גיטרה, ומערבלים לתערובת פירורית.',
      'מוסיפים את החלמון ומעבדים עד שמתקבל בצק.',
      'יוצרים מהבצק כדור, משטחים אותו מעט ומעבירים אותו לשעה למקרר (עטוף בניילון נצמד).',
      'מעבירים את הבצק למשטח מקומח, ומרדדים. קורצים עיגולים, ממלאים בממרח לוטוס (או מה שבא לנו באותו רגע) וסוגרים לצורת אוזן המן (3 פאות).',
      'מעבירים לחצי שעה למקפיא.',
      'בתנור שמחומם ל-180 מעלות אופים כ-15 דקות, להזהבה קלה ומצננים לחלוטין.'
    ],
    notes: 'מעולה!'
  },
  {
    title: `מרק אפונה טעים`,
    ingredients: [
      {
        title: 'מצרכים',
        ingredients: [
          '1 בצל קצוץ',
          '2 כפות שמן',
          '1 תפו"א',
          '2 גזרים גדולים',
          '3 ענפי סלרי עם העלים',
          '2 1/2 כוסות אפונה שטופה',
          '2 כפות אבקת מרק',
          'פלפל'
        ]
      }
    ],
    steps: [
      'מטגנים את הבצל בשמן.',
      'מוסיפים את שאר הירקות.',
      'מוסיפים מים רותחים כדי כיסוי ואז את אבקת המרק והפלפל.',
      'מרתיחים ומנמיכים את האש. מבשלים עד שהכל רך.',
      'אחרי שהצטנן מרסקים בבלנדר מוט.'
    ]
  }
]

export default recipes
